cfd/cases/fluke_L2U000/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     overPimpleDyMFoam;
libs            ("liboverset.so" "libfvMotionSolvers.so");
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         2.0000;
deltaT          0.00044;
writeControl    adjustableRunTime;
writeInterval   0.02500;
purgeWrite      0;
writeFormat     binary;
writePrecision  8;
writeCompression on;
timeFormat      general;
timePrecision   7;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           0.8;
maxDeltaT       0.00176;
functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");
        patches         (paddle);
        rho             rhoInf;
        rhoInf          1000.0;
        CofR            (0.06345 0 0.00400);     // 力矩参考点 = 运动表原点（腿 = 髋轴 O2）；铰链力矩在后处理里换算
        writeControl    timeStep;
        writeInterval   1;
        log             false;
    }
    vorticity1 { type vorticity; libs ("libfieldFunctionObjects.so"); writeControl writeTime; }
}
